{"_id":{"$oid":"5e9c19d13060a1071e806901"},"Title":"Back to The Future","Description":"It stars Michael J. Fox as teenager Marty McFly, who accidentally travels back in time, where he meets his future parents and becomes his mother's romantic interest.","Genre":{"Name":"Science Fiction","Description":"Science fiction film (or sci-fi film) is a genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream science, such as extraterrestrial lifeforms, alien worlds, extrasensory perception and time travel, along with futuristic elements such as spacecraft, robots, cyborgs, interstellar travel or other technologies."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American director, film producer and screenwriter frequently credited as an innovator in visual effects. Zemeckis first came to public attention in the 1980s as the director of the comedic time-travel Back to the Future film series, as well as the Academy Award-winning live-action/animation epic Who Framed Roger Rabbit (1988), though in the 1990s he diversified into more dramatic fare, including 1994's Forrest Gump, for which he won an Academy Award for Best Director. His films are characterized by an interest in state-of-the-art special effects, including the early use of match moving in Back to the Future Part II (1989) and the pioneering performance capture techniques seen in The Polar Express (2004), Beowulf (2007) and A Christmas Carol (2009). Though Zemeckis has often been pigeonholed as a director interested only in effects, his work has been defended by several critics, including David Thomson, who wrote that 'No other contemporary director has used special effects to more dramatic and narrative purpose.'.","Birth":"1951"},"ImagePath":"backtothefuture.png","Featured":true}
{"_id":{"$oid":"5e9c20483060a1071e806903"},"Title":"Harry Potter and the Philosopher's Stone","Description":"Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents'deaths -- and about the villian who's to blame.","Genre":{"Name":"Fantasy","Description":"A fantasy story is about magic or supernatural forces, rather than technology (as science fiction) if it happens to take place in a modern or future era. Depending on the extent of these other elements, the story may or may not be considered to be a 'hybrid genre' series; for instance, even though the Harry Potter series canon includes the requirement of a particular gene to be a wizard, it is referred to only as a fantasy series."},"Director":{"Name":"Chris Columbus","Bio":"Christopher Joseph Columbus is an American film director, producer and screenwriter. Columbus had most success with the first film in the Harry Potter and the Sorcerer's Stone, along with Home Alone, winning a British Comedy Award for Best Comedy Film.","Birth":"1958"},"ImagePath":"harrypotter.png","Featured":true}
{"_id":{"$oid":"5e9c34bb3060a1071e806905"},"Title":"Romeo + Juliet","Description":"In director Baz Luhrmann's contemporary take on William Shakespeare's classic tragedy, the Montagues and Capulets have moved their ongoing feud to the sweltering suburb of Verona Beach, where Romeo and Juliet fall in love and secretly wed. Though the film is visually modern, the bard's dialogue remains.","Genre":{"Name":"Drama","Description":"Dramas are serious, plot-driven presentations, portraying realistic characters, settings, life situations, and stories involving intense character development and interaction. Usually, they are not focused on special-effects, comedy, or action, Dramatic films are probably the largest film genre, with many subsets."},"Director":{"Name":"Baz Luhrmann","Bio":"Mark Anthony 'Baz' Luhrmann is an Australian film director, screenwriter, and producer best known for The Red Curtain Trilogy, which includes his films Strictly Ballroom, William Shakespeare's Romeo + Juliet and Moulin Rouge!. In 2008, he released his film Australia, starring Hugh Jackman and Nicole Kidman.","Birth":"1962"},"ImagePath":"romeojuliet.png","Featured":true}
{"_id":{"$oid":"5e9c35b83060a1071e806906"},"Title":"Starwars, The Rise of Skywalker","Description":"The surviving Resistance faces the First Order once again as the journey of Rey, Finn and Poe Dameron continues. With the power and knowledge of generations behind them, the final battle begins.","Genre":{"Name":"Science Fiction","Description":"Science fiction is similar to fantasy, except stories in this genre use scientific understanding to explain the universe that it takes place in. It generally includes or is centered on the presumed effects or ramifications of computers or machines; travel through space, time or alternate universes; alien life-forms; genetic engineering; or other such things."},"Director":{"Name":"J.J. Abrams","Bio":"Abrams has created numerous television series, including Felicity, Alias, Lost, and Fringe. He won two Emmy Awards for Lost — Outstanding Directing for a Drama Series and Outstanding Drama Series. His directorial film work includes Mission: Impossible III (2006), Star Trek (2009), Super 8 (2011), and Star Trek Into Darkness (2013). He also directed, produced and co-wrote Star Wars. He returned to Star Wars by co-writing, producing and directing the ninth and final installment of the saga, Star Wars: The Rise of Skywalker (2019)","Birth":"1966"},"ImagePath":"starwars.png","Featured":true}
{"_id":{"$oid":"5e9c365e3060a1071e806907"},"Title":"The Blues Brothers","Description":"Jake Blues is just out of jail, and teams up with his brother, Elwood on a 'mission from God' to raise funds for the orphanage in which they grew up. The only thing they can do is do what they do best: play music. So they get their old band together, and set out on their way—while getting in a bit of trouble here and there.","Genre":{"Name":"Comedy","Description":"Comedies are light-hearted plots consistently and deliberately designed to amuse and provoke laughter (with one-liners, jokes, etc.) by exaggerating the situation, the language, action, relationships and characters. This section describes various forms of comedy through cinematic history, including slapstick, screwball, spoofs and parodies, romantic comedies, black comedy (dark satirical comedy), and more."},"Director":{"Name":"John Landis","Bio":"John Landis is an American film director, screenwriter, actor, and producer. He is known for his comedies, his horror films, and his music videos with singer Michael Jackson.","Birth":"1950"},"ImagePath":"bluesbrothers.png","Featured":true}
{"_id":{"$oid":"5e9c37033060a1071e806908"},"Title":"Pulp Fiction","Description":"A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.","Genre":{"Name":"Crime","Description":"Crime films, in the broadest sense, are a film genre inspired by and analogous to the crime fiction literary genre. Films of this genre generally involve various aspects of crime and its detection. Stylistically, the genre may overlap and combine with many other genres, such as drama or gangster film, but also include comedy, and, in turn, is divided into many sub-genres, such as mystery, suspense or noir."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino is an American film director, screenwriter, producer, cinematographer and actor. In the early 1990s he was an independent filmmaker whose films used nonlinear storylines and aestheticization of violence. His films have earned him a variety of Academy Award, Golden Globe, BAFTA and Palme d'Or Awards and he has been nominated for Emmy and Grammy Awards. Tarantino was born in Knoxville, Tennessee, the son of Connie McHugh Tarantino Zastoupil, a health care executive and nurse born in Knoxville, and Tony Tarantino, an actor and amateur musician born in Queens, New York.","Birth":"1963"},"ImagePath":"pulpfiction.png","Featured":true}
{"_id":{"$oid":"5e9c37af3060a1071e806909"},"Title":"Interstellar","Description":"Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.","Genre":{"Name":"Epic","Description":"Epic films are a style of filmmaking with large scale, sweeping scope, and spectacle. The usage of the term has shifted over time, sometimes designating a film genre and at other times simply synonymous with big-budget filmmaking. Like epics in the classical literary sense it is often focused on a heroic character."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan, is a British-American film director, screenwriter, and producer. He was born in Westminster, London, England and holds both British and American citizenship due to his American mother. He is known for writing and directing critically acclaimed films such as Memento (2000), The Prestige (2006), The Dark Knight Trilogy (2005-12), Inception (2010), Interstellar (2014) and Dunkirk (2017). Nolan is the founder of the production company Syncopy Films. He often collaborates with his wife, producer Emma Thomas, and his brother, screenwriter Jonathan Nolan.","Birth":"1970"},"ImagePath":"interstellar.png","Featured":true}
{"_id":{"$oid":"5e9c38d33060a1071e80690a"},"Title":"The Lion King","Description":"Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.","Genre":{"Name":"Computer animated","Description":"Computer animation is the process used for digitally generating animated images. The more general term computer-generated imagery (CGI) encompasses both static scenes and dynamic images, while computer animation only refers to moving images. Modern computer animation usually uses 3D computer graphics."},"Director":{"Name":"Jon Favreau","Bio":"Jonathan Favreau is an American actor, director, producer, and screenwriter. As an actor, he is known for roles in films such as ‘Rudy’ (1993), ‘Swingers’ (1996) (which he also wrote), ‘Very Bad Things’ (1998), ‘Daredevil’ (2003), ‘The Break-Up’ (2006), ‘Couples Retreat’ (2009), and ‘Chef’ (2014) (which he also wrote and directed). He has additionally directed the films ‘Elf’ (2003), ‘Zathura: A Space Adventure’ (2005), ‘Iron Man’ (2008), ‘Iron Man 2’ (2010), ‘Cowboys & Aliens’ (2011), ‘The Jungle Book’ (2016), and ‘The Lion King’ (2019) and served as an executive producer on ‘The Avengers’ (2012), ‘Iron Man 3’ (2013), ‘Avengers: Age of Ultron’ (2015), ‘Avengers: Infinity War’ (2018) and ‘Avengers: Endgame’ (2019). Favreau also portrays Happy Hogan in the Marvel Cinematic Universe and played Pete Becker during season three of the television sitcom ‘Friends’. He produces films under his banner, Fairview Entertainment. The company has been credited as co-producers in most of Favreau's directorial ventures.","Birth":"1966"},"ImagePath":"lionking.png","Featured":true}
{"_id":{"$oid":"5e9c3aa23060a1071e80690b"},"Title":"Spiderman, Far From Home","Description":"Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.","Genre":{"Name":"Action","Description":"Action films usually include high energy, big-budget physical stunts and chases, possibly with rescues, battles, fights, escapes, destructive crises (floods, explosions, natural disasters, fires, etc.), non-stop motion, spectacular rhythm and pacing, and adventurous, often two-dimensional 'good-guy' heroes (or recently, heroines) battling 'bad guys' - all designed for pure audience escapism. Includes the James Bond 'fantasy' spy/espionage series, martial arts films, video-game films, so-called 'blaxploitation' films, and some superhero films."},"Director":{"Name":"Jon Watts","Bio":"Jon Watts is an American film director, producer and screenwriter. He directed the films Clown and Cop Car and episodes of the Onion News Network. Watts was born and raised in Fountain, Colorado. He studied film at New York University. Before directing movies, Watts directed commercials for production company Park Pictures. When trying to get the job directing Spider-Man: Homecoming, Watts got a tattoo of Spider-Man on his chest to make himself ‘stand out in the field’.","Birth":"1981"},"ImagePath":"spiderman.png","Featured":true}
{"_id":{"$oid":"5e9c3b623060a1071e80690c"},"Title":"Titanic","Description":"101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.","Genre":{"Name":"Drama","Description":"Dramas are serious, plot-driven presentations, portraying realistic characters, settings, life situations, and stories involving intense character development and interaction. Usually, they are not focused on special-effects, comedy, or action, Dramatic films are probably the largest film genre, with many subsets."},"Director":{"Name":"James Cameron","Bio":"James Cameron was born in Kapuskasing, Ontario, Canada, on August 16, 1954. He moved to the USA in 1971. The son of an engineer, he majored in physics at California State University but, after graduating, drove a truck to support his screen-writing ambition. He landed his first professional film job as art director, miniature-set builder, and process-projection supervisor on Roger Corman's Battle Beyond the Stars (1980) and debuted as a director with Piranha Part Two: The Spawning (1981) the following year. In 1984, he wrote and directed The Terminator (1984), a futuristic action-thriller starring Arnold Schwarzenegger, Michael Biehn, and Linda Hamilton. It was a huge success. After this came a string of successful science-fiction action films such as Aliens (1986) and Terminator 2: Judgment Day (1991). Cameron is now one of the most sought-after directors in Hollywood. He was formerly married to producer Gale Anne Hurd, who produced several of his films. He married Kathryn Bigelow in 1989.","Birth":"1954"},"ImagePath":"titanic.png","Featured":true}
{"_id":{"$oid":"5e9c3f623060a1071e80690e"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"5e9da6faaa98398565197490"},"Title":"Jurassic Park","Description":"The film is set on the fictional island of Isla Nublar, located off Central America's Pacific Coast near Costa Rica. There, wealthy businessman John Hammond and a team of genetic scientists have created a wildlife park of de-extinct dinosaurs.","Genre":{"Name":"Adventure","Description":"Adventure films are a genre of film that typically use their action scenes to display and explore exotic locations in an energetic way."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"jurassicpark.png","Featured":true}
{"_id":{"$oid":"5e9da83faa98398565197491"},"Title":"Jaws","Description":"In 1975, a fledgling filmmaker named Steven Spielberg released a little movie about a big shark. It went on to become the prototypical summer blockbuster, and turned Spielberg into a household name. That movie is, of course, Jaws, and it remains an all-time classic – the type of film that is somehow endlessly rewatchable from beginning to end. There have been many home media releases of Jaws over the years, but to mark the film’s 45th anniversary this June, Universal is going even bigger with the first-ever Jaws 4K release.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg is an American filmmaker. He is considered one of the founding pioneers of the New Hollywood era and one of the most popular directors and producers in film history. Spielberg started in Hollywood directing television and several minor theatrical releases.","Birth":"1946"},"ImagePath":"jaws.png","Featured":true}
{"_id":{"$oid":"6362f294a161b36bb4ecbfba"},"Title":"Top Gun: Maverick","Description":"After thirty years, Maverick is still pushing the envelope as a top naval aviator, but...","Genre":{"Name":"Action","Description":"Action films are built around a core set of characteristics: spectacular physical action; a narrative emphasis on fights, chases, and explosions; and a combination of state-of-the-art special effects and stunt-work."},"Director":{"name":"Joseph Kosinski","Bio":"Joseph Kosinski is a director whose uncompromising style has quickly made a mark in the filmmaking zeitgeist. His feature film debut,...","Birth":"1974"},"ImagePath":"topgun.png","Featured":true}
{"_id":{"$oid":"6363cbdf5104a2e70685e935"},"Title":"Dune","Description":"A noble familiy becomes embroiled n a war for control over the galaxys most valuable asset while its heir becomes troubled by visions of a dark future.","Genre":{"Name":"Action","Description":"Action films are built around a core set of characteristics: spectacular physical action; a narrative emphasis on fights, chases, and explosions; and a combination of state-of-the-art special effects and stunt-work."},"Director":{"Name":"Denis Villeneuve","Bio":"Denis Villeneuve is a French Canadian film director and writer. He was born in 1967, in Trois-Rivières, Québec, Canada. He started his career as a filmmaker at the National Film Board of Canada.","Birth":"1967"},"ImagePath":"dune.png","Featured":true}
